rails/app/controllers/hosts_controller.rb

  def index
    @hosts = Host.all
---
SELECT * FROM "hosts"

  def edit_wiring
    @hosts = Host.all
---
SELECT * FROM "hosts"

  def edited_wiring

    if params[:commit] == 'Connect'
      @wiring = Wiring.new
      @wiring.port_id1 = params[:h_port][:id]
      @wiring.port_id2 = params[:f_port][:id]
      @wiring.save
---
INSERT INTO "wirings" ("port_id1", "port_id2") VALUES(25, 38) RETURNING "id"

  def show_wiring
    @hosts = Host.all
---
SELECT * FROM "hosts"

  def show
    @host = Host.find(params[:id])
---
SELECT * FROM "hosts" WHERE ("hosts"."id" = 1)

  def edit
    @host = Host.find(params[:id])
---
SELECT * FROM "hosts" WHERE ("hosts"."id" = 1)

  def create
    @host = Host.new
    @port = Port.new
    @mac_addr = MacAddr.new

	ActiveRecord::Base.transaction do
      begin
        @host.hostname = params[:hostname]
        @host.building = params[:building]
        @host.room     = params[:room]
        @host.owner    = params[:owner]
        @host.save!

        @port.host_id  = @host.id
        @port.label    = params[:label]
        @port.save!

        @mac_addr.port_id = @port.id
        @mac_addr.mac_address = params[:mac_addr]
        @mac_addr.save!
---
INSERT INTO "hosts" ("hostname", "building", "room", "detail", "owner", "model", "os") VALUES(E'adelie.cs.pdx.edu', E'FAB', E'C88-01', NULL, E'tutors', NULL, NULL) RETURNING "id"
INSERT INTO "ports" ("host_id", "label") VALUES(NULL, E'only port') RETURNING "id"
INSERT INTO "mac_addrs" ("port_id", "mac_address") VALUES(2, E'00:13:A9:3D:6A:5E') RETURNING "id"

  def update
    @host = Host.find(params[:id])

    respond_to do |format|
      if @host.update_attributes(params[:host])
---
SELECT * FROM "hosts" WHERE ("hosts"."id" = 1)
UPDATE "hosts" SET "owner" = E'acronym' WHERE "id" = 1

  def destroy
    @host = Host.find(params[:id])
    @host.destroy
---
SELECT * FROM "hosts" WHERE ("hosts"."id" = 6)
DELETE FROM "hosts" WHERE "id" = 6