rails/app/controllers/ip_addrs_controller.rb

SELECT * FROM "ip_addrs"
---
  def index
    @ip_addrs = IpAddr.all